# บรรทัดที่ 1   นำเข้า Library ที่เกี่ยวข้อง
import streamlit as st

# บรรทัดที่ 2   สร้างหัวข้อ “แอปพลิเคชั่นแปลง พ.ศ. เป็น ค.ศ.”
st.title("แอปพลิเคชั่นแปลง พ.ศ. เป็น ค.ศ.")

# บรรทัดที่ 4   สร้างตัวแปร bh_year เก็บข้อมูลชื่อจากกล่องรับข้อมูลตัวเลข โดยกำหนดค่าที่เริ่มแสดงเป็น 2569
bh_year = st.number_input("กรอกปี พ.ศ.", value=2569, step=1)

# บรรทัดที่ 5   สร้างตัวแปร ce_year เก็บข้อมูลในตัวแปร bh_year - 543
ce_year = bh_year - 543

# บรรทัดที่ 6   สร้างหัวข้อความแสดงคำตอบที่แปลงเป็นปี ค.ศ. จากในตัวแปร ce_year โดย f คือให้ข้อความเชื่อมกับตัวเลขในตัวแปร
st.subheader(f"ปี ค.ศ. คือ: {ce_year}")
