 ตัวเลือกโค๊ด
อัลกอรึทีม
โค๊ดที่เรียงสำเร็จ
st.title("🛒แอปพลิเคชั่นคำนวณราคาสินค้ารวม VAT 7%")
ระบุคำสั่ง import
 
vat = price * 0.07
แสดงชื่อแอปพลิเคชั่น
 
st.header(f"• ภาษีมูลค่าเพิ่ม (VAT 7%): **{vat:.2f}** บาท")
สร้างช่องรับข้อมูลตัวเลขราคา
 
 
ตัวแปร vat คำนวณ 7%
 
import streamlit as st
ตัวแปร net_price คำนวณราคา - vat
 
price = st.number_input("กรอกราคาสินค้า (บาท):", value=0.0)
แสดงจำนวน Vat
 
net_price = price - vat
แสดงราคาสุทธิ
 
st.write("นางสาวดีใจ ยิ้มแย้ม เลขที่ 5  ม.4/5")
สร้างเส้นกั้น
st.divider()
st.header(f"• ราคาสุทธิ: {net_price:.2f} บาท")
แสดงข้อมูลนักเรียน
 
